racecarAero/archive/car_20260719_125421_full/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// omega = sqrt(k) / (Cmu^0.25 * l), l = 0.07 * carHeight (1.124 m)

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 71.1;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 71.1;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 71.1;
        value           uniform 71.1;
    }

    ground
    {
        type            omegaWallFunction;
        value           uniform 71.1;
    }

    top
    {
        type            slip;
    }

    farField
    {
        type            slip;
    }

    symmetry
    {
        type            symmetryPlane;
    }

    "body_.*"
    {
        type            omegaWallFunction;
        value           uniform 71.1;
    }

    mirror
    {
        type            omegaWallFunction;
        value           uniform 71.1;
    }

    "frontVent.*"
    {
        type            omegaWallFunction;
        value           uniform 71.1;
    }

    "sideSkirt.*"
    {
        type            omegaWallFunction;
        value           uniform 71.1;
    }

    "vg.*"
    {
        type            omegaWallFunction;
        value           uniform 71.1;
    }

    "diffuserFin.*"
    {
        type            omegaWallFunction;
        value           uniform 71.1;
    }

    rearSpoiler
    {
        type            omegaWallFunction;
        value           uniform 71.1;
    }

    "engSim.*"
    {
        type            zeroGradient;
    }

    "frontWheel_.*"
    {
        type            omegaWallFunction;
        value           uniform 71.1;
    }

    "backWheel_.*"
    {
        type            omegaWallFunction;
        value           uniform 71.1;
    }
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
