racecarAero/archive/car_20260719_125421_full/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Kinematic pressure (p/rho) - standard for incompressible simpleFoam
dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    ground
    {
        type            zeroGradient;
    }

    top
    {
        type            slip;
    }

    farField
    {
        type            slip;
    }

    symmetry
    {
        type            symmetryPlane;
    }

    "body_.*"
    {
        type            zeroGradient;
    }

    mirror
    {
        type            zeroGradient;
    }

    "frontVent.*"
    {
        type            zeroGradient;
    }

    "sideSkirt.*"
    {
        type            zeroGradient;
    }

    "vg.*"
    {
        type            zeroGradient;
    }

    "diffuserFin.*"
    {
        type            zeroGradient;
    }

    rearSpoiler
    {
        type            zeroGradient;
    }

    "engSim.*"
    {
        type            zeroGradient;
    }

    "frontWheel_.*"
    {
        type            zeroGradient;
    }

    "backWheel_.*"
    {
        type            zeroGradient;
    }
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
