racecarAero/archive/car_20260719_125421_full/system/amgxpOptions
{
    "config_version": 2,
    "determinism_flag": 1,
    "solver": {
        "preconditioner": {
            "print_grid_stats": 0,
            "algorithm": "AGGREGATION",
            "print_vis_data": 0,
            "solver": "AMG",
            "smoother": {
                "relaxation_factor": 0.8,
                "scope": "jacobi",
                "solver": "BLOCK_JACOBI",
                "monitor_residual": 0,
                "print_solve_stats": 0
            },
            "print_solve_stats": 0,
            "presweeps": 1,
            "interpolator": "D2",
            "selector": "SIZE_2",
            "coarse_solver": "NOSOLVER",
            "max_iters": 1,
            "monitor_residual": 0,
            "store_res_history": 0,
            "scope": "amg",
            "max_levels": 25,
            "postsweeps": 1,
            "cycle": "V"
        },
        "solver": "PCG",
        "print_solve_stats": 0,
        "obtain_timings": 0,
        "max_iters": 300,
        "monitor_residual": 1,
        "store_res_history": 1,
        "convergence": "RELATIVE_INI",
        "scope": "main",
        "tolerance": 1e-5,
        "norm": "L2"
    }
}
