racecarAero/archive/car_20260719_125421_full/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    // Matches OpenFOAM's own motorBike (external car aero) tutorial: only
    // limit grad(U) specifically, not every gradient by default - limiting
    // grad(p)/grad(k)/grad(omega) unnecessarily adds numerical diffusion.
    default         Gauss linear;
    grad(U)         cellLimited Gauss linear 1;
}

divSchemes
{
    default             none;
    div(phi,U)          bounded Gauss linearUpwindV grad(U);
    div(phi,k)          bounded Gauss upwind;
    div(phi,omega)      bounded Gauss upwind;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;

    // Used by potentialFoam's initial irrotational-flow guess
    div(div(phi,U))     Gauss linear;
}

laplacianSchemes
{
    // "limited 0.33" is for meshes with poor non-orthogonality - matching
    // the motorBike tutorial's plain "corrected" since our mesh quality
    // checks came back clean (0 non-orthogonality/skewness violations).
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method          meshWave;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
